In [1]:
import pandas as pd
import numpy as np

In [2]:
test_puntajes = {'Pedro':[88, 89, 90], 'Laura': [2,3,4], 'Fernanda': [24, 26, 28]}

In [3]:
df = pd.DataFrame(test_puntajes)

In [4]:
df = df.T

In [5]:
df

           0   1   2
Pedro     88  89  90
Laura      2   3   4
Fernanda  24  26  28

In [6]:
df.columns = ['Test1', 'Test2', 'Test3']

In [7]:
df

          Test1  Test2  Test3
Pedro        88     89     90
Laura         2      3      4
Fernanda     24     26     28

In [8]:
df['Test4']= [99, 98, 97]

In [9]:
df

          Test1  Test2  Test3  Test4
Pedro        88     89     90     99
Laura         2      3      4     98
Fernanda     24     26     28     97

In [11]:
df_new = pd.DataFrame({'Quiz1': [np.NaN], 'Quiz2': [np.NaN], 'Quiz3': [np.NaN], 'Quiz4':[75]}, index=["Adrian"])

In [12]:
df_new

        Quiz1  Quiz2  Quiz3  Quiz4
Adrian    NaN    NaN    NaN     75

In [13]:
df = pd.concat([df, df_new])

In [14]:
df

          Test1  Test2  Test3  Test4  Quiz1  Quiz2  Quiz3  Quiz4
Pedro      88.0   89.0   90.0   99.0    NaN    NaN    NaN    NaN
Laura       2.0    3.0    4.0   98.0    NaN    NaN    NaN    NaN
Fernanda   24.0   26.0   28.0   97.0    NaN    NaN    NaN    NaN
Adrian      NaN    NaN    NaN    NaN    NaN    NaN    NaN   75.0

In [15]:
df['Quiz_Avg'] = df.mean(axis=1, skipna=True)

In [16]:
df

          Test1  Test2  Test3  Test4  Quiz1  Quiz2  Quiz3  Quiz4  Quiz_Avg
Pedro      88.0   89.0   90.0   99.0    NaN    NaN    NaN    NaN     91.50
Laura       2.0    3.0    4.0   98.0    NaN    NaN    NaN    NaN     26.75
Fernanda   24.0   26.0   28.0   97.0    NaN    NaN    NaN    NaN     43.75
Adrian      NaN    NaN    NaN    NaN    NaN    NaN    NaN   75.0     75.00

In [17]:
df.Quiz4.astype(float)

Pedro        NaN
Laura        NaN
Fernanda     NaN
Adrian      75.0
Name: Quiz4, dtype: float64

In [18]:
df.Quiz_Avg.astype(int)

Pedro       91
Laura       26
Fernanda    43
Adrian      75
Name: Quiz_Avg, dtype: int32

In [19]:
df

          Test1  Test2  Test3  Test4  Quiz1  Quiz2  Quiz3  Quiz4  Quiz_Avg
Pedro      88.0   89.0   90.0   99.0    NaN    NaN    NaN    NaN     91.50
Laura       2.0    3.0    4.0   98.0    NaN    NaN    NaN    NaN     26.75
Fernanda   24.0   26.0   28.0   97.0    NaN    NaN    NaN    NaN     43.75
Adrian      NaN    NaN    NaN    NaN    NaN    NaN    NaN   75.0     75.00